In [16]:
import pandas as pd

In [17]:
df1 = pd.DataFrame([['a', 1], ['b', 2]],
                   columns=['letter', 'number'])
df2 = pd.DataFrame([['c', 1], ['d', 2]],
                   columns=['letter', 'number'])

print(df1)
print(df2)

  letter  number
0      a       1
1      b       2
  letter  number
0      c       1
1      d       2

In [19]:
pd.concat([df1, df2], ignore_index=True)

  letter  number
0      a       1
1      b       2
2      c       1
3      d       2